----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1    [-1, 16, 128, 128, 128]             448
       BatchNorm3d-2    [-1, 16, 128, 128, 128]              32
         LeakyReLU-3    [-1, 16, 128, 128, 128]               0
            Conv3d-4    [-1, 16, 128, 128, 128]           6,928
       BatchNorm3d-5    [-1, 16, 128, 128, 128]              32
            Conv3d-6    [-1, 16, 128, 128, 128]              32
       BatchNorm3d-7    [-1, 16, 128, 128, 128]              32
         LeakyReLU-8    [-1, 16, 128, 128, 128]               0
          Res18Blk-9    [-1, 16, 128, 128, 128]               0
        MaxPool3d-10       [-1, 16, 64, 64, 64]               0
											7504

           Conv3d-11       [-1, 32, 64, 64, 64]          13,856
      BatchNorm3d-12       [-1, 32, 64, 64, 64]              64
        LeakyReLU-13       [-1, 32, 64, 64, 64]               0
           Conv3d-14       [-1, 32, 64, 64, 64]          27,680
      BatchNorm3d-15       [-1, 32, 64, 64, 64]              64
           Conv3d-16       [-1, 32, 64, 64, 64]             544
      BatchNorm3d-17       [-1, 32, 64, 64, 64]              64
        LeakyReLU-18       [-1, 32, 64, 64, 64]               0
         Res18Blk-19       [-1, 32, 64, 64, 64]               0
        MaxPool3d-20       [-1, 32, 32, 32, 32]               0
											42273

           Conv3d-21       [-1, 64, 32, 32, 32]          55,360
      BatchNorm3d-22       [-1, 64, 32, 32, 32]             128
        LeakyReLU-23       [-1, 64, 32, 32, 32]               0
           Conv3d-24       [-1, 64, 32, 32, 32]         110,656
      BatchNorm3d-25       [-1, 64, 32, 32, 32]             128
           Conv3d-26       [-1, 64, 32, 32, 32]           2,112
      BatchNorm3d-27       [-1, 64, 32, 32, 32]             128
        LeakyReLU-28       [-1, 64, 32, 32, 32]               0
         Res18Blk-29       [-1, 64, 32, 32, 32]               0
        MaxPool3d-30       [-1, 64, 16, 16, 16]               0
											168512

           Conv3d-31      [-1, 128, 16, 16, 16]         221,312
      BatchNorm3d-32      [-1, 128, 16, 16, 16]             256
        LeakyReLU-33      [-1, 128, 16, 16, 16]               0
           Conv3d-34      [-1, 128, 16, 16, 16]         442,496
      BatchNorm3d-35      [-1, 128, 16, 16, 16]             256
           Conv3d-36      [-1, 128, 16, 16, 16]           8,320
      BatchNorm3d-37      [-1, 128, 16, 16, 16]             256
        LeakyReLU-38      [-1, 128, 16, 16, 16]               0
         Res18Blk-39      [-1, 128, 16, 16, 16]               0
        MaxPool3d-40         [-1, 128, 8, 8, 8]               0
											672896

           Conv3d-41         [-1, 256, 8, 8, 8]         884,992
      BatchNorm3d-42         [-1, 256, 8, 8, 8]             512
        LeakyReLU-43         [-1, 256, 8, 8, 8]               0
           Conv3d-44         [-1, 256, 8, 8, 8]       1,769,728
      BatchNorm3d-45         [-1, 256, 8, 8, 8]             512
           Conv3d-46         [-1, 256, 8, 8, 8]          33,024
      BatchNorm3d-47         [-1, 256, 8, 8, 8]             512
        LeakyReLU-48         [-1, 256, 8, 8, 8]               0
         Res18Blk-49         [-1, 256, 8, 8, 8]               0
         Upsample-50      [-1, 256, 16, 16, 16]               0
											2,689,280

           Conv3d-51      [-1, 128, 16, 16, 16]       1,327,232
      BatchNorm3d-52      [-1, 128, 16, 16, 16]             256
        LeakyReLU-53      [-1, 128, 16, 16, 16]               0
           Conv3d-54      [-1, 128, 16, 16, 16]         442,496
      BatchNorm3d-55      [-1, 128, 16, 16, 16]             256
           Conv3d-56      [-1, 128, 16, 16, 16]          49,280
      BatchNorm3d-57      [-1, 128, 16, 16, 16]             256
        LeakyReLU-58      [-1, 128, 16, 16, 16]               0
         Res18Blk-59      [-1, 128, 16, 16, 16]               0
         Upsample-60      [-1, 128, 32, 32, 32]               0
											1,819,776

           Conv3d-61       [-1, 64, 32, 32, 32]         331,840
      BatchNorm3d-62       [-1, 64, 32, 32, 32]             128
        LeakyReLU-63       [-1, 64, 32, 32, 32]               0
           Conv3d-64       [-1, 64, 32, 32, 32]         110,656
      BatchNorm3d-65       [-1, 64, 32, 32, 32]             128
           Conv3d-66       [-1, 64, 32, 32, 32]          12,352
      BatchNorm3d-67       [-1, 64, 32, 32, 32]             128
        LeakyReLU-68       [-1, 64, 32, 32, 32]               0
         Res18Blk-69       [-1, 64, 32, 32, 32]               0
         Upsample-70       [-1, 64, 64, 64, 64]               0
											455,232

           Conv3d-71       [-1, 32, 64, 64, 64]          82,976
      BatchNorm3d-72       [-1, 32, 64, 64, 64]              64
        LeakyReLU-73       [-1, 32, 64, 64, 64]               0
           Conv3d-74       [-1, 32, 64, 64, 64]          27,680
      BatchNorm3d-75       [-1, 32, 64, 64, 64]              64
           Conv3d-76       [-1, 32, 64, 64, 64]           3,104
      BatchNorm3d-77       [-1, 32, 64, 64, 64]              64
        LeakyReLU-78       [-1, 32, 64, 64, 64]               0
         Res18Blk-79       [-1, 32, 64, 64, 64]               0
         Upsample-80    [-1, 32, 128, 128, 128]               0
											113,952

           Conv3d-81    [-1, 16, 128, 128, 128]          20,752
      BatchNorm3d-82    [-1, 16, 128, 128, 128]              32
        LeakyReLU-83    [-1, 16, 128, 128, 128]               0
           Conv3d-84    [-1, 16, 128, 128, 128]           6,928
      BatchNorm3d-85    [-1, 16, 128, 128, 128]              32
           Conv3d-86    [-1, 16, 128, 128, 128]             784
      BatchNorm3d-87    [-1, 16, 128, 128, 128]              32
        LeakyReLU-88    [-1, 16, 128, 128, 128]               0
         Res18Blk-89    [-1, 16, 128, 128, 128]               0
           Conv3d-90     [-1, 1, 128, 128, 128]             433
          Sigmoid-91     [-1, 1, 128, 128, 128]               0
											28,993
================================================================
Total params: 5,998,417
Trainable params: 5,998,417
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 8.00
Forward/backward pass size (MB): 6883.50
Params size (MB): 22.88
Estimated Total Size (MB): 6914.38
----------------------------------------------------------------
