----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1    [-1, 16, 128, 128, 128]             448
              ReLU-2    [-1, 16, 128, 128, 128]               0
            Conv3d-3    [-1, 16, 128, 128, 128]           6,928
              ReLU-4    [-1, 16, 128, 128, 128]               0
         MaxPool3d-5       [-1, 16, 64, 64, 64]               0
											7,376

            Conv3d-6       [-1, 32, 64, 64, 64]          13,856
              ReLU-7       [-1, 32, 64, 64, 64]               0
            Conv3d-8       [-1, 32, 64, 64, 64]          27,680
              ReLU-9       [-1, 32, 64, 64, 64]               0
        MaxPool3d-10       [-1, 32, 32, 32, 32]               0
											41,536

           Conv3d-11       [-1, 64, 32, 32, 32]          55,360
             ReLU-12       [-1, 64, 32, 32, 32]               0
           Conv3d-13       [-1, 64, 32, 32, 32]         110,656
             ReLU-14       [-1, 64, 32, 32, 32]               0
        MaxPool3d-15       [-1, 64, 16, 16, 16]               0
											166,016

           Conv3d-16      [-1, 128, 16, 16, 16]         221,312
             ReLU-17      [-1, 128, 16, 16, 16]               0
           Conv3d-18      [-1, 128, 16, 16, 16]         442,496
             ReLU-19      [-1, 128, 16, 16, 16]               0
         Upsample-20      [-1, 128, 32, 32, 32]               0
											663,808									

           Conv3d-21       [-1, 64, 32, 32, 32]         331,840
             ReLU-22       [-1, 64, 32, 32, 32]               0
           Conv3d-23       [-1, 64, 32, 32, 32]         110,656
             ReLU-24       [-1, 64, 32, 32, 32]               0
         Upsample-25       [-1, 64, 64, 64, 64]               0
											442,496

           Conv3d-26       [-1, 32, 64, 64, 64]          82,976
             ReLU-27       [-1, 32, 64, 64, 64]               0
           Conv3d-28       [-1, 32, 64, 64, 64]          27,680
             ReLU-29       [-1, 32, 64, 64, 64]               0
         Upsample-30    [-1, 32, 128, 128, 128]               0
											110,656

           Conv3d-31    [-1, 16, 128, 128, 128]          20,752
             ReLU-32    [-1, 16, 128, 128, 128]               0
           Conv3d-33    [-1, 16, 128, 128, 128]           6,928
             ReLU-34    [-1, 16, 128, 128, 128]               0
           Conv3d-35     [-1, 1, 128, 128, 128]             433
          Sigmoid-36     [-1, 1, 128, 128, 128]               0

================================================================
Total params: 1,460,001
Trainable params: 1,460,001
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 8.00
Forward/backward pass size (MB): 3450.00
Params size (MB): 5.57
Estimated Total Size (MB): 3463.57
----------------------------------------------------------------
